Revit 2027 API
SingleServerService.GetActiveServerId(Document) Method
 Returns the Id of the server currently associated with the given document for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetActiveServerId(
	Document document
)
Public Function GetActiveServerId (
	document As Document
) As Guid
public:
Guid GetActiveServerId(
	Document^ document
)
member GetActiveServerId :
        document : Document -> Guid
Parameters
document Document
 The document for which the server is being set as active.
Return Value
Guid
 The Guid of the active server, or an invalid Guid if there is no active server assigned.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SingleServerService Class
GetActiveServerId Overload
Autodesk.Revit.DB.ExternalService Namespace